interreg-nomade/dcu-firmware-v2/app/app_nRF52_com.c
/*
 * app_nRF52_com.c
 *
 *  Created on: 25 Nov 2021
 *      Author: sarah
 */
#include "app_nRF52_com.h"
#include "FreeRTOS.h"
#include "cmsis_os.h"
#include "usart.h"
#include "../lib/ring_buffer/ringbuffer_char.h"
#include <string.h>
#include "../Inc/usb_com.h"
#include "data/structures.h"
#include "app_terminal_com.h"
//#include "app_imu.h"
#include "app_BLEmodule1.h"
#include "app_BLEmodule2.h"
#include "app_BLEmodule3.h"
#include "app_BLEmodule4.h"
#include "app_BLEmodule5.h"
#include "app_BLEmodule6.h"

#include "queues/streamer_service/streamer_service_queue.h"
#include "config/parameters_id.h"
#include "nRF52_driver.h"

#define PRINTF_nRF52_COMMANAGER 1
#define PRINTF_nRF52_COM 1

/* RTOS Variables */
static osThreadId nRF52RxTaskHandle;

/* Com link protocol variables */
static nRF52_msg_t nRF52RxMsg;
static ring_buffer_t nRF52RingbufRx;

extern streamerServiceQueueMsg_t streamMsgEnabled;

extern imu_module imu_1;
extern imu_module imu_2;
extern imu_module imu_3;
extern imu_module imu_4;
extern imu_module imu_5;
extern imu_module imu_6;

extern imu_module *imu_array [];
extern int numberOfModules;
extern int numberOfModulesMACAddressAvailable;
extern int numberOfModulesConnected;
extern int numberOfModulesCalibrated;
extern int numberOfModulesSampleRateGiven;
extern int numberOfModulesOutputDataTypeGiven;
extern int numberOfModulesSynchronized;

extern char string[];
extern QueueHandle_t pPrintQueue;

imu_module *imunRF52 = NULL;
uint8_t previous_connected_modules [6];

char command;

void nRF52ComManagerThread(const void *params);

/* Declare private functions */
static int nRF52_FindSdByte(void);
static int nRF52_HeaderPartPresent(void);
static int nRF52_BuildHeader(void);
static int nRF52_BodyPartPresent(void);
static int nRF52_BuildBody(void);
static int nRF52_csCorrect(void);
//static void rsv_data_handler(uint8_t * buf, uint8_t sensor_number, uint8_t data_format);
static int nRF52_TimedOut(unsigned int * var);
static void nRF52_RstTimeout(unsigned int * var);

static void BLEmoduleDataToSensorEvent1(int32_t data[20], imu_100Hz_data_t *sensorEvent);
static void BLEmoduleDataToSensorEvent2(int32_t data[20], imu_100Hz_data_t *sensorEvent);


imu_100Hz_data_t sensorEvent;
imu_100Hz_data_t sensorModule1Event;
imu_100Hz_data_t sensorModule2Event;
imu_100Hz_data_t sensorModule3Event;
imu_100Hz_data_t sensorModule4Event;
imu_100Hz_data_t sensorModule5Event;
imu_100Hz_data_t sensorModule6Event;

void nRF52_init_rx_task(void)
{
  osDelay(100);
  nRF52_init(); // Init the decoder
#if PRINTF_nRF52_COMMANAGER
  sprintf(string, "nRF52_com_init_rx_task done. \n");
  HAL_UART_Transmit(&huart7, (uint8_t *)string, strlen(string), 25);
#endif
  memset(&nRF52RxMsg, 0, sizeof(nRF52_msg_t));
  osThreadDef(nRF52ComManager, nRF52ComManagerThread, osPriorityNormal, 0, 1024);
  nRF52RxTaskHandle = osThreadCreate(osThread(nRF52ComManager), NULL);
}

void nRF52ComManagerThread(const void *params)
{
  osDelay(100);
  uint8_t timesFound = 0;
  int flag100HzModule1 = 0;
  int flag100HzModule2 = 0;
  int flag100HzModule3 = 0;
  int flag100HzModule4 = 0;
  int flag100HzModule5 = 0;
  int flag100HzModule6 = 0;
  for(;;)
  {
	nRF52_DECODER_RESULT nRF52Res = nRF52_prot_decoder(&nRF52RxMsg);
    if (nRF52Res == nRF52_CORRECT_FRAME)
	{
      if (nRF52RxMsg.commandType == 1)
      {// received frame is measurement data
    	if (streamMsgEnabled.action == streamerService_EnableAndroidStream)
        {
//#if PRINTF_nRF52_COMMANAGER
//          sprintf(string, "%u Payload: ", (unsigned int) HAL_GetTick()); // shorter sentence to print as much as possible...
//      	  char DUString[3];
//      	  for (int i = 7; i < nRF52RxMsg.length; i++)
//      	  {
//      	    if (strlen(string) < 149)
//      	    {
//          	  sprintf(DUString, "%02X",nRF52RxMsg.DU[i]);
//          	  strcat(string, DUString);
//      	    }
//      	  }
//       	  strcat(string,"\n");
//      	  xQueueSend(pPrintQueue, string, 0);
//#endif
    	  int32_t data[20];
    	  uint64_t timestamp;
    	  int value = 0;
    	  uint16_t start_pos = 5;
//!    	  sensorEvent.module = nRF52RxMsg.DU[3];
    	  switch (nRF52RxMsg.DU[4]) // Data Type of nRF52 received message: Quaternions = 1, Euler = 2, RAW = 3
    	  {
  	        case 0x01:
  	        { //Quaternions
  	    	  //   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F 10 11 12 13 14 15 16 17 18 19 1A 1B 1C 1D
  	          //                 +---------+ +---------+ +---------+ +---------+ +---------------------+
  	      	  //0x73 1E 01 01 01 00 58 CF 3F E0 3E 6E FC 70 47 25 01 74 1C D1 FC B8 43 00 00 E9 FF FF FF 33
  	  		  //   |  |  |  |  | +----v----+ +----v----+ +----v----+ +----v----+ +----------v----------+  |
  	  		  //   |  |  |  |  |      |           |           |           |                 |             +--> CS
  	  		  //   |  |  |  |  |      |           |           |           |                 +--> uint64_t epochNow_Ms
  	  		  //   |  |  |  |  |      |           |           |           +--> int32_t z (rotVectors.k)
  	  		  //   |  |  |  |  |      |           |           +--> int32_t y (rotVectors.j)
  	  		  //   |  |  |  |  |      |           +--> int32_t x (rotVectors.i)
  	  		  //   |  |  |  |  |      +--> int32_t w (rotVectors.real)
  	  		  //   |  |  |  |  +--> Data Type: Quaternions = 1, Euler = 2, RAW = 3
  	  		  //   |  |  |  +--> sensor nr
  	  		  //   |  |  +--> command type: DATA
  	  		  //   |  +--> total length of packet
  	  		  //   +--> start delimiter
  	    	  for(uint8_t g = 0; g < 4; g++)
  	    	  {
        	    // data[0] = rotVectors.real
        	    // data[1] = rotVectors.i
        	    // data[2] = rotVectors.j
        	    // data[3] = rotVectors.k
//  	    	    data[g] = ((nRF52RxMsg.DU[start_pos + g*4] << 24) | (nRF52RxMsg.DU[start_pos + g*4 + 1] << 16) |
//  	    	    		   (nRF52RxMsg.DU[start_pos + g*4 + 2] << 8) | nRF52RxMsg.DU[start_pos + g*4 + 3]);
  	    	    data[g] = ((nRF52RxMsg.DU[start_pos + g*4 + 3] << 24) | (nRF52RxMsg.DU[start_pos + g*4 + 2] << 16) |
  	    	    		   (nRF52RxMsg.DU[start_pos + g*4 + 1] << 8) | nRF52RxMsg.DU[start_pos + g*4]);
  	    	    //data[g] = (float)data[g]/(float)(1<<30);
  	    	  }
  	    	  for (uint8_t g = 0x1C; g > 0x14; g--)
  	    	  {
     	        timestamp = (timestamp << 8) | nRF52RxMsg.DU[g];
  	    	  }
	    	  //timestamp = nRF52RxMsg.DU[15] | (nRF52RxMsg.DU[16] << 8) | (nRF52RxMsg.DU[17] << 16) | (nRF52RxMsg.DU[18] << 24 |);
	    	  //sprintf(string, "[app_nRF52_com] sample frequency: %u \n", (unsigned int) imu_array[0]->sampleFrequency);
	    	  //xQueueSend(pPrintQueue, string, 0);
  	          break;
  	        }
  	        case 0x02:
  	        {//Euler
  	          //todo
  	          break;
  	        }
  	        case 0x03:
  	        { //RAW
  	          //   0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F 10 11 12 13 14 15 16 17 18 19 1A 1B 1C 1D 1E 1F
  	          //                 +---+ +---+ +---+ +---+ +---+ +---+ +---+ +---+ +---+ +---------------------+
  	          //0x73 20 01 00 03 14 00 21 00 FE 03 01 00 F9 FF F4 FF 21 00 54 01 F2 FD 18 08 00 00 E9 FF FF FF E8
  	          //   |  |  |  |  | +-v-+ +-v-+ +-v-+ +-v-+ +-v-+ +-v-+ +-v-+ +-v-+ +-v-+ +----------v----------+  |
  	          //   |  |  |  |  |   |     |     |     |     |     |     |     |     |              |             +--> CS
  	          //   |  |  |  |  |   |     |     |     |     |     |     |     |     |              +--> uint64_t epochNow_Ms
  	          //   |  |  |  |  |   |     |     |     |     |     |     |     |     +--> int16_t Magnetometer z
  	          //   |  |  |  |  |   |     |     |     |     |     |     |     +--> int16_t Magnetometer y
  	          //   |  |  |  |  |   |     |     |     |     |     |     +--> int16_t Magnetometer x
  	          //   |  |  |  |  |   |     |     |     |     |     +--> int16_t Accelerometer z
  	          //   |  |  |  |  |   |     |     |     |     +--> int16_t Accelerometer y
  	          //   |  |  |  |  |   |     |     |     +--> int16_t Accelerometer x
  	          //   |  |  |  |  |   |     |     +--> int16_t Gyroscope z
  	          //   |  |  |  |  |   |     +--> int16_t Gyroscope y
  	          //   |  |  |  |  |   +--> int16_t Gyroscope x
  	          //   |  |  |  |  +--> Data Type: Quaternions = 1, Euler = 2, RAW = 3
  	          //   |  |  |  +--> sensor nr
  	          //   |  |  +--> command type: DATA
  	          //   |  +--> total length of packet
  	          //   +--> start delimiter
  	    	  for(uint8_t g = 0; g < 9; g++)
  	    	  {
  	    	    // data[4] = gyroscope.x
  	    	    // data[5] = gyroscope.y
  	    	    // data[6] = gyroscope.z
  	    	    // data[7] = accelerometer.x
  	    	    // data[8] = accelerometer.y
  	    	    // data[9] = accelerometer.z
  	    	    // data[10] = magnetometer.x
  	    	    // data[11] = magnetometer.y
  	    	    // data[12] = magnetometer.z
//  	    	    data[4 + g] = ((nRF52RxMsg.DU[start_pos + g*2] << 8) | nRF52RxMsg.DU[start_pos + g*2 + 1]);
  	    	    data[4 + g] = ((nRF52RxMsg.DU[start_pos + g*2 + 1] << 8) | nRF52RxMsg.DU[start_pos + g*2]);
  	    	    //data[g] = (float)data[g]/(float)(1<<30);
  	    	  }
  	    	  for (uint8_t g = 0x1E; g > 0x16; g--)
  	    	  {
     	        timestamp = (timestamp << 8) | nRF52RxMsg.DU[g];
  	    	  }
  	          break;
  	        }
    	  }
    	  switch(imu_array[nRF52RxMsg.DU[3]]->sampleFrequency) // nRF52RxMsg.DU[3] is the module nr
    	  {
    	    case 10:  value = 5;  break;
    	    case 25:  value = 2;  break;
    	    case 50:  value = 1;  break;
    	    case 100: value = 100;  break;
    	    default:
    	    { /* if sample frequency is not a defined value, the sample frequency is set to 50Hz */
    	      value = 1;
    	    }
    	  }
    	  if (value == 100)
    	  { // this handles following cases of imu_array[nRF52RxMsg.DU[3]]->outputDataType:
    		// case SETUP_PRM_DATA_OUTPUT_DATATYPE_IMUGYRO_ACC_MAG_100HZ:
    		// case SETUP_PRM_DATA_OUTPUT_DATATYPE_IMUQUAT_GYRO_ACC_100HZ:
    		// case SETUP_PRM_DATA_OUTPUT_DATATYPE_IMUQUAT_100HZ:
    		// case SETUP_PRM_DATA_OUTPUT_DATATYPE_IMUQUAT_9DOF_100HZ:
        	switch(nRF52RxMsg.DU[3]) // sensor nr
        	{
        	  case 0x00:
        	  {
                if (flag100HzModule1)
                {
//          	      sensorModule1Event.rotVectors2.real = data[0];
//          	      sensorModule1Event.rotVectors2.i    = data[1];
//          	      sensorModule1Event.rotVectors2.j    = data[2];
//          	      sensorModule1Event.rotVectors2.k    = data[3];
//      	    	  sensorModule1Event.gyroscope2.x	  = data[4];
//      	    	  sensorModule1Event.gyroscope2.y	  = data[5];
//      	    	  sensorModule1Event.gyroscope2.z	  = data[6];
//      	    	  sensorModule1Event.accelerometer2.x = data[7];
//      	    	  sensorModule1Event.accelerometer2.y = data[8];
//      	    	  sensorModule1Event.accelerometer2.z = data[9];
//      	    	  sensorModule1Event.magnetometer2.x  = data[10];
//      	    	  sensorModule1Event.magnetometer2.y  = data[11];
//      	    	  sensorModule1Event.magnetometer2.z  = data[12];
      	    	  BLEmoduleDataToSensorEvent2(data, &sensorModule1Event);
      	    	  sensorHandlerBLEmodule1(&sensorModule1Event);
         	      flag100HzModule1--;
                }
                else
                {
//            	  sensorModule1Event.rotVectors1.real = data[0];
//            	  sensorModule1Event.rotVectors1.i    = data[1];
//            	  sensorModule1Event.rotVectors1.j    = data[2];
//            	  sensorModule1Event.rotVectors1.k    = data[3];
//        	      sensorModule1Event.gyroscope1.x	  = data[4];
//        	      sensorModule1Event.gyroscope1.y	  = data[5];
//        	   	  sensorModule1Event.gyroscope1.z	  = data[6];
//        	   	  sensorModule1Event.accelerometer1.x = data[7];
//        	   	  sensorModule1Event.accelerometer1.y = data[8];
//        	   	  sensorModule1Event.accelerometer1.z = data[9];
//        	   	  sensorModule1Event.magnetometer1.x  = data[10];
//        	   	  sensorModule1Event.magnetometer1.y  = data[11];
//        	   	  sensorModule1Event.magnetometer1.z  = data[12];
      	    	  BLEmoduleDataToSensorEvent1(data, &sensorModule1Event);
         	      flag100HzModule1++;
                }
        	    break;
        	  }
        	  case 0x01:
        	  {
                if (flag100HzModule2)
                {
      	    	  BLEmoduleDataToSensorEvent2(data, &sensorModule2Event);
        	      sensorHandlerBLEmodule2(&sensorModule2Event);
           	      flag100HzModule2--;
                }
                else
                {
      	    	  BLEmoduleDataToSensorEvent1(data, &sensorModule2Event);
           	      flag100HzModule2++;
                }
        	    break;
        	  }
        	  case 0x02:
        	  {
                if (flag100HzModule3)
                {
      	    	  BLEmoduleDataToSensorEvent2(data, &sensorModule3Event);
        	   	  sensorHandlerBLEmodule3(&sensorModule3Event);
           	      flag100HzModule3--;
                }
                else
                {
      	    	  BLEmoduleDataToSensorEvent1(data, &sensorModule3Event);
           	      flag100HzModule3++;
                }
        	   	break;
          	  }
        	  case 0x03:
        	  {
                if (flag100HzModule4)
                {
      	    	  BLEmoduleDataToSensorEvent2(data, &sensorModule4Event);
        	   	  sensorHandlerBLEmodule4(&sensorModule4Event);
           	      flag100HzModule4--;
                }
                else
                {
      	    	  BLEmoduleDataToSensorEvent1(data, &sensorModule4Event);
           	      flag100HzModule4++;
                }
        	    break;
        	  }
        	  case 0x04:
        	  {
                if (flag100HzModule5)
                {
      	    	  BLEmoduleDataToSensorEvent2(data, &sensorModule5Event);
        	   	  sensorHandlerBLEmodule5(&sensorModule5Event);
           	      flag100HzModule5--;
                }
                else
                {
      	    	  BLEmoduleDataToSensorEvent1(data, &sensorModule5Event);
           	      flag100HzModule5++;
                }
        	    break;
        	  }
        	  case 0x05:
        	  {
                if (flag100HzModule6)
                {
      	    	  BLEmoduleDataToSensorEvent2(data, &sensorModule6Event);
        	   	  sensorHandlerBLEmodule6(&sensorModule6Event);
           	      flag100HzModule6--;
                }
                else
                {
      	    	  BLEmoduleDataToSensorEvent1(data, &sensorModule6Event);
           	      flag100HzModule6++;
                }
        	    break;
        	  }
              default:
              {
#if PRINTF_nRF52_COMMANAGER
            	  sprintf(string, "%u [app_nRF52_com] sensor event error in sending data to BLE sensor queue coming from module %u: ", (unsigned int) HAL_GetTick(), (unsigned int) nRF52RxMsg.DU[3]);
            	  char DUString[6];
            	  for (int s = 0; s < 9; s++)
                  {
            	    sprintf(DUString, "%04X ", (unsigned int) data[s]);
            	    strcat(string, DUString);
            	  }
            	  strcat(string,"\n");
            	  xQueueSend(pPrintQueue, string, 0);
#endif
              }
        	}
    	  }
    	  else
    	  { // this handles following cases of imu_array[nRF52RxMsg.DU[3]]->outputDataType:
  	        // case SETUP_PRM_DATA_OUTPUT_DATATYPE_IMUQUAT:
  	        // case SETUP_PRM_DATA_OUTPUT_DATATYPE_IMUQUATBAT: // battery voltage level not yet implemented
  	        // case SETUP_PRM_DATA_OUTPUT_DATATYPE_IMUQUAT_GYRO_ACC:
  	        // case SETUP_PRM_DATA_OUTPUT_DATATYPE_IMUQUAT_9DOF:
  	        // case SETUP_PRM_DATA_OUTPUT_DATATYPE_IMUGYRO_ACC_MAG:
	    	BLEmoduleDataToSensorEvent1(data, &sensorEvent);
        	for (uint8_t f = 0; f < value; f++)
            { // repeat same data, depending on selected sampling frequency
        	  switch (nRF52RxMsg.DU[3]) // sensor nr
        	  {
        	    case 0x00:
        	    {
        	      sensorHandlerBLEmodule1(&sensorEvent);
        	      break;
        	    }
        	    case 0x01:
        	    {
        	      sensorHandlerBLEmodule2(&sensorEvent);
        	      break;
        	    }
        	    case 0x02:
        	    {
        	   	  sensorHandlerBLEmodule3(&sensorEvent);
        	   	  break;
        	   	}
        	   	case 0x03:
        	   	{
        	      sensorHandlerBLEmodule4(&sensorEvent);
        	      break;
        	    }
        	    case 0x04:
        	   	{
        	      sensorHandlerBLEmodule5(&sensorEvent);
        	      break;
        	    }
        	    case 0x05:
        	    {
        	      sensorHandlerBLEmodule6(&sensorEvent);
        	      break;
        	    }
                default:
            	{
#if PRINTF_nRF52_COMMANAGER
            	  sprintf(string, "%u [app_nRF52_com] sensor event error in sending data to BLE sensor queue coming from module %u: ", (unsigned int) HAL_GetTick(), (unsigned int) nRF52RxMsg.DU[3]);
            	  char DUString[6];
            	  for (int s = 0; s < 9; s++)
                  {
            	    sprintf(DUString, "%04X ", (unsigned int) data[s]);
            	    strcat(string, DUString);
            	  }
            	  strcat(string,"\n");
            	  xQueueSend(pPrintQueue, string, 0);
#endif
            	}
        	  }
            } // end of repeat same data, depending on selected sampling frequency
    	  }
        } // end of if (streamMsgEnabled.action == streamerService_EnableAndroidStream)
      } // end of received frame is measurement data
      else
      { // received frame is configuration data
		switch (nRF52RxMsg.command)
		{
		  case COMM_CMD_SET_CONN_DEV_LIST:
		  {
#if PRINTF_nRF52_COMMANAGER
			sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] nRF52 module SET_CONN_DEV_LIST command received.\n",(unsigned int) HAL_GetTick());
			xQueueSend(pPrintQueue, string, 0);
#endif
		  }
		  break;
		  case COMM_CMD_REQ_CONN_DEV_LIST:
		  {
#if PRINTF_nRF52_COMMANAGER
		    sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] nRF52 module REQ_CONN_DEV_LIST command received.\n",(unsigned int) HAL_GetTick());
            xQueueSend(pPrintQueue, string, 0);
#endif
			//
			// if i = 0->7 is module index, j = 0->5 is MAC address byte and offset is 7, then 7+i*10+j is pointing to the address byte per module in the nRF52RxMsg.DU[].
			//
			//                                        <-------------1------------>  <-------------2------------>  <-------------3------------>  <-------------4------------>  <-------------5------------>  <-------------6------------>  <-------------7------------>  <-------------8------------>
            //                            0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F 10 11 12 13 14 15 16 17 18 19 1A 1B 1C 1D 1E 1F 20 21 22 23 24 25 26 27 28 29 2A 2B 2C 2D 2E 2F 30 31 32 33 34 35 36 37 38 39 3A 3B 3C 3D 3E 3F 40 41 42 43 44 45 46 47 48 49 4A 4B 4C 4D 4E 4F 50 51 52 53 54
			//                            1  2  3  4  5  6  7  8  9 10  1  2  3  4  5  6  7  8  9 20  1  2  3  4  5  6  7  8  9 30  1  2  3  4  5  6  7  8  9 40  1  2  3  4  5  6  7  8  9 50  1  2  3  4  5  6  7  8  9 60  1  2  3  4  5  6  7  8  9 70  1  2  3  4  5  6  7  8  9 80  1  2  3  4  5
			//example received buffer: 0x73 55 02 02 FF FF 02 0D 11 29 0F 2C D4 00 00 00 02 C6 D8 42 14 35 E8 00 FF FF 02 FF FF FF FF FF FF 00 FF FF 02 FF FF FF FF FF FF 00 FF FF 02 FF FF FF FF FF FF 00 FF FF 02 FF FF FF FF FF FF 00 FF FF 02 FF FF FF FF FF FF 00 FF FF 02 FF FF FF FF FF FF 00 71
			//                            |  |  |  |  ?  ?  ? +-------v-------+  ?          +-------v-------+             +-------v-------+             +-------v-------+             +-------v-------+             +-------v-------+             +-------v-------+             +-------v-------+     |
			//                            |  |  |  |  |  |  |         |                             |                             |                             |                             |                             |                             |                             |             +--> Check Sum
			//                            |  |  |  |  |  |  |         |                             |                             |                             |                             |                             |                             |                             |
			//                            |  |  |  |  |  |  |         |                             |                             |                             |                             |                             |                             |                             +--> MAC address module 8
			//                            |  |  |  |  |  |  |         |                             |                             |                             |                             |                             |                             +--> MAC address module 7
			//                            |  |  |  |  |  |  |         |                             |                             |                             |                             |                             +--> MAC address module 6
			//                            |  |  |  |  |  |  |         |                             |                             |                             |                             +--> MAC address module 5
			//                            |  |  |  |  |  |  |         |                             |                             |                             +--> MAC address module 4
			//                            |  |  |  |  |  |  |         |                             |                             +--> MAC address module 3
			//                            |  |  |  |  |  |  |         |                             +--> MAC address module 2
			//                            |  |  |  |  |  |  |         +--> MAC address module 1
			//                            |  |  |  |  |  |  +--> conn_handle?? maar dat kan niet, want conn_handle is een uint16_t
			//                            |  |  |  |  |  +--> according to ble_gap_addr_t Struct Reference, this is uint8_t ble_gap_addr_t::addr_type. Following possibilities are defined in nordic api:
			//                            |  |  |  |  |       #define BLE_GAP_ADDR_TYPE_PUBLIC                        0x00 Public address.
			//                            |  |  |  |  |       #define BLE_GAP_ADDR_TYPE_RANDOM_STATIC                 0x01 Random private non-resolvable address.
			//                            |  |  |  |  |       #define BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_RESOLVABLE     0x02 Random private resolvable address.
			//                            |  |  |  |  |       #define BLE_GAP_ADDR_TYPE_RANDOM_PRIVATE_NON_RESOLVABLE 0x03 Random static address.
			//                            |  |  |  |  +--> according to ble_gap_addr_t Struct Reference, this is uint8_t ble_gap_addr_t::addr_id_peer. Only valid for peer addresses.
			//                            |  |  |  |       Reference to peer in device identities list (as set with sd_ble_gap_device_identities_set) when peer is using privacy.
			//                            |  |  |  +--> command --> command_type_byte_t:
			//                            |  |  |                    SET_CONN_DEV_LIST    = 0x1
			//                            |  |  |                   *REQ_CONN_DEV_LIST    = 0x2
			//                            |  |  |                    START_MEASUREMENT    = 0x3  All sensors will start to measure at the same time
			//                            |  |  |                    STOP_MEASUREMENT     = 0x4  All sensors will stop to measure at the same time
