interreg-nomade/dcu-firmware-v2/app/app_nRF52_com.c
			//                            |  |  |                    SET_MEAS_DATA_TYPE   = 0x5  Not possible to give different sensors different settings, the settings are stored in the DCU (nRF) and send to all connected sensors when START_MEASUREMENT command is received, after x ms the measurements start synchronously.
			//                            |  |  |                    TIME_SYNC_SENSORS    = 0x6
			//                            |  |  |                    SET_SAMPLE_FREQUENCY = 0x7  This should be done per sensor, for instance when different sensors are connected like IMU and EMG. This is not implemented at the moment
			//                            |  |  |                    START_CALIBRATION    = 0x8  ?? Can this be done per sensor ?? Not all sensors need calibration... + list of calibrated sensors
			//                            |  |  |                    CMD_RESET            = 0x9  This resets the configuration profile on the nRF, can also be changed by overriding existing settings.
			//                            |  |  |                    REQ_BATTERY_LEVEL    = 0xA  Battery level of all connected sensors
			//                            |  |  +--> command Type --> command_byte_t:  DATA   = 0x1
			//                            |  |                                        *CONFIG = 0x2
			//                            |  +--> packet_len is the number of elements of the COMPLETE package, including SD, Command, Packet_length and CS. In this case 0x55 = 85 elements.
			//                            +--> start delimiter
#if PRINTF_nRF52_COMMANAGER
			sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] nRF52 module REQ_CONN_DEV_LIST command received.\n",(unsigned int) HAL_GetTick());
			xQueueSend(pPrintQueue, string, 0);
			module_status_overview();
#endif
		  }
		  break;
		  case COMM_CMD_START:
		  {
#if PRINTF_nRF52_COMMANAGER
			sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] nRF52 module START command received.\n",(unsigned int) HAL_GetTick());
			xQueueSend(pPrintQueue, string, 0);
#endif
		  }
		  break;
		  case COMM_CMD_STOP:
		  {
#if PRINTF_nRF52_COMMANAGER
			sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] nRF52 module STOP command received.\n",(unsigned int) HAL_GetTick());
			xQueueSend(pPrintQueue, string, 0);
#endif
		  }
		  break;
		  case COMM_CMD_MEAS:
	      {
#if PRINTF_nRF52_COMMANAGER
			sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] nRF52 module MEAS command received.\n",(unsigned int) HAL_GetTick());
			xQueueSend(pPrintQueue, string, 0);
#endif
		  }
		  break;
		  case COMM_CMD_SYNC:
		  {
			//                             0  1  2  3  4  5  6
			// Example received buffer: 0x73 07 02 06 02 01 73
			// Example received buffer: 0x73 07 02 06 00 01 71
			//                             |  |  |  |  |  |  |
			//                             |  |  |  |  |  |  +--> CS
			//                             |  |  |  |  |  +--> always 1?
			//                             |  |  |  |  +--> module nr, from 0 to 7.
			//                             |  |  |  +--> COMM_CMD_SYNC
			//                             |  |  +--> command type: CONFIG
			//                             |  +--> total length of packet
			//                             +--> start delimiter
#if PRINTF_nRF52_COM
            char DUString[4];
            sprintf(string, "nRF52 rec buffer: 0x");
            xQueueSend(pPrintQueue, string, 0);
            int loper = 0;
            for (int i = 0; i < nRF52RxMsg.length; i++)
            {
              sprintf(DUString, "%02X ",nRF52RxMsg.DU[i]);
              strcat(string, DUString);
              if (loper++ > 16)
              {
              	loper = 0;
                xQueueSend(pPrintQueue, string, 0);
                sprintf(string, "");
              }
            }
            sprintf(DUString, "  \n");
            strcat(string, DUString);
            xQueueSend(pPrintQueue, string, 0);
#endif
#if PRINTF_nRF52_COMMANAGER
			sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] nRF52 module SYNC command received for module %01X.\n",(unsigned int) HAL_GetTick(), nRF52RxMsg.DU[4]);
			xQueueSend(pPrintQueue, string, 0);
#endif
			imu_array[nRF52RxMsg.DU[4]]->is_synchronized = nRF52RxMsg.DU[5];
			// check if all modules are calibrated:
			timesFound = 0;
			for (int k = 0; k < numberOfModules; k++)
			{
			  if (imu_array[k]->is_synchronized == 0x01)
			  {
				timesFound++;
			  }
			  if (timesFound == numberOfModules)
			  {
				numberOfModulesSynchronized = numberOfModules;
#if PRINTF_nRF52_COMMANAGER
				sprintf(string, "[app_nRF52_com] [nRF52ComManagerThread] All BLE modules synchronized.\n");
				xQueueSend(pPrintQueue, string, 0);
#endif
			  }
			}
		  }
		  break;
		  case COMM_CMD_FREQUENCY:
		  {
#if PRINTF_nRF52_COMMANAGER
			sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] nRF52 module FREQUENCY command received.\n",(unsigned int) HAL_GetTick());
			xQueueSend(pPrintQueue, string, 0);
#endif
		  }
		  break;
		  case COMM_CMD_CALIBRATE:
		  {
			//                             0  1  2  3  4  5  6
			// Example received buffer: 0x73 07 02 08 00 01 7F
			//                             |  |  |  |  |  |  |
			//                             |  |  |  |  |  |  +--> CS
			//                             |  |  |  |  |  +--> calibration status: normal calibration sequence is 1 -> 3 -> 4 -> 2
			//                             |  |  |  |  |                           1 = COMM_CMD_CALIBRATION_START
			//                             |  |  |  |  |                           2 = COMM_CMD_CALIBRATION_MAG_DONE (so full calibration done)
			//                             |  |  |  |  |                           3 = COMM_CMD_CALIBRATION_GYRO_DONE
			//                             |  |  |  |  |                           4 = COMM_CMD_CALIBRATION_ACCEL_DONE
			//                             |  |  |  |  +--> module nr, from 0 to 7.
			//                             |  |  |  +--> COMM_CMD_CALIBRATE
			//                             |  |  +--> command type: CONFIG
			//                             |  +--> total length of packet
			//                             +--> start delimiter
#if PRINTF_nRF52_COMMANAGER
			switch(nRF52RxMsg.DU[5])
			{
			  case COMM_CMD_CALIBRATION_START:
			  {
			    sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Calibration started for %s.\n",(unsigned int) HAL_GetTick(),imu_array[nRF52RxMsg.DU[4]]->name);
				xQueueSend(pPrintQueue, string, 0);
				break;
			  }
			  case COMM_CMD_CALIBRATION_DONE:
			  {
			    sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Magnetometer calibration done for %s.\n",(unsigned int) HAL_GetTick(),imu_array[nRF52RxMsg.DU[4]]->name);
			    xQueueSend(pPrintQueue, string, 0);
				break;
			  }
			  case COMM_CMD_CALIBRATION_GYRO_DONE:
			  {
				sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Gyroscope calibration done for %s.\n",(unsigned int) HAL_GetTick(),imu_array[nRF52RxMsg.DU[4]]->name);
				xQueueSend(pPrintQueue, string, 0);
				break;
			  }
			  case COMM_CMD_CALIBRATION_ACCEL_DONE:
			  {
				sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Accelerometer calibration done for %s.\n",(unsigned int) HAL_GetTick(),imu_array[nRF52RxMsg.DU[4]]->name);
				xQueueSend(pPrintQueue, string, 0);
				break;
			  }
			  default:
			  {
			    sprintf(string, "[app_init] [initThread] Try to calibrate gyroscope of connected modules. None defined value in imu_array[i]->is_calibrated.\n");
				xQueueSend(pPrintQueue, string, 0);
			  }
			}
#endif
			imu_array[nRF52RxMsg.DU[4]]->is_calibrated = nRF52RxMsg.DU[5];
			// check if all modules are calibrated:
			timesFound = 0;
			for (int k = 0; k < numberOfModules; k++)
			{
			  if (imu_array[k]->is_calibrated == 0x02)
			  {
				timesFound++;
			  }
			  if (timesFound == numberOfModules)
			  {
				numberOfModulesCalibrated = numberOfModules;
#if PRINTF_nRF52_COMMANAGER
				sprintf(string, "[app_nRF52_com] [nRF52ComManagerThread] All BLE nodes calibrated.\n");
				xQueueSend(pPrintQueue, string, 0);
#endif
			  }
			}
	      }
		  break;
		  case COMM_CMD_RESET:
		  {
#if PRINTF_nRF52_COMMANAGER
			sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] nRF52 module RESET command received.\n",(unsigned int) HAL_GetTick());
			xQueueSend(pPrintQueue, string, 0);
#endif
		  }
		  break;
          case COMM_CMD_REQ_BATTERY_LEVEL:
		  {
#if PRINTF_nRF52_COMMANAGER
			sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] nRF52 module REQ_BATTERY_LEVEL command received.\n",(unsigned int) HAL_GetTick());
			xQueueSend(pPrintQueue, string, 0);
#endif
		  }
		  break;
		  case COMM_CMD_OK:
          {
			// Example received buffer: 0x73 07 02 0B FF 01 83
			//                             |  |  |  |  |  |  |
			//                             |  |  |  |  |  |  +--> CS
			//                             |  |  |  |  |  +--> refers to the requested command where this OK is referring to
			//                             |  |  |  |  +--> not in use for the moment, but it would be good to give here the command reference where the OK is pointed to.
			//                             |  |  |  +--> COMM_CMD_OK
			//                             |  |  +--> command type: CONFIG
			//                             |  +--> total length of packet
			//                             +--> start delimiter
#if PRINTF_nRF52_COMMANAGER
			switch(nRF52RxMsg.DU[5])
			{
			   case COMM_CMD_SET_CONN_DEV_LIST:
			   {
				  numberOfModulesMACAddressAvailable = numberOfModules;
				  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] MAC addresses confirmed by nRF52 module.\n",(unsigned int) HAL_GetTick());
				  xQueueSend(pPrintQueue, string, 0);
				  break;
			   }
			   case COMM_CMD_REQ_CONN_DEV_LIST:
			   {
				  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Device list request confirmed by nRF52 module.\n",(unsigned int) HAL_GetTick());
				  xQueueSend(pPrintQueue, string, 0);
				  break;
			   }
			   case COMM_CMD_START:
			   {
				  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Start measurement command confirmed by nRF52 module.\n",(unsigned int) HAL_GetTick());
				  xQueueSend(pPrintQueue, string, 0);
				  break;
			   }
			   case COMM_CMD_STOP:
			   {
				  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Stop measurement command confirmed by nRF52 module.\n",(unsigned int) HAL_GetTick());
				  xQueueSend(pPrintQueue, string, 0);
				  break;
			   }
			   case COMM_CMD_MEAS:
			   {
				  // example received buffer: 0x73 07 02 0B FF 05 87
				  //                             |  |  |  |  |  |  |
				  //                             |  |  |  |  |  |  +--> CS
				  //                             |  |  |  |  |  +--> refers to the requested command MEAS
				  //                             |  |  |  |  +--> not in use for the moment, but it would be good to give here the command reference where the OK is pointed to.
				  //                             |  |  |  +--> COMM_CMD_OK
				  //                             |  |  +--> command type: CONFIG
				  //                             |  +--> total length of packet
				  //                             +--> start delimiter
				  numberOfModulesOutputDataTypeGiven = numberOfModules;
				  for (int k = 0; k < numberOfModules; k++)
				  {
					 imu_array[k]->outputDataTypeGiven = 0x01;
				  }
				  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Output data type command confirmed by nRF52 module.\n",(unsigned int) HAL_GetTick());
				  xQueueSend(pPrintQueue, string, 0);
				  break;
			   }
			   case COMM_CMD_SYNC:
			   {
				  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Synchronization command confirmed by nRF52 module.\n",(unsigned int) HAL_GetTick());
				  xQueueSend(pPrintQueue, string, 0);
				  break;
			   }
			   case COMM_CMD_FREQUENCY:
			   {
				  // example received buffer: 0x73 07 02 0B FF 07 85
				  //                             |  |  |  |  |  |  |
				  //                             |  |  |  |  |  |  +--> CS
				  //                             |  |  |  |  |  +--> refers to the requested command set Frequency
				  //                             |  |  |  |  +--> not in use for the moment, but it would be good to give here the command reference where the OK is pointed to.
				  //                             |  |  |  +--> COMM_CMD_OK
				  //                             |  |  +--> command type: CONFIG
				  //                             |  +--> total length of packet
				  //                             +--> start delimiter
				  numberOfModulesSampleRateGiven = numberOfModules;
				  for (int k = 0; k < numberOfModules; k++)
				  {
					 imu_array[k]->sampleRateGiven = 0x01;
				  }
				  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Sample rate command confirmed by nRF52 module.\n",(unsigned int) HAL_GetTick());
				  xQueueSend(pPrintQueue, string, 0);
				  break;
			   }
			   case COMM_CMD_CALIBRATE:
			   {
				  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Calibration command confirmed by nRF52 module.\n",(unsigned int) HAL_GetTick());
				  xQueueSend(pPrintQueue, string, 0);
				  break;
			   }
			   case COMM_CMD_RESET:
			   {
				  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Reset command confirmed by nRF52 module.\n",(unsigned int) HAL_GetTick());
				  xQueueSend(pPrintQueue, string, 0);
				  break;
			   }
			   case COMM_CMD_REQ_BATTERY_LEVEL:
			   {
				  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Battery level command confirmed by nRF52 module.\n",(unsigned int) HAL_GetTick());
				  xQueueSend(pPrintQueue, string, 0);
				  break;
			   }
			   case COMM_CMD_OK:
			   {
				  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] OK command received by nRF52 module.\n",(unsigned int) HAL_GetTick());
				  xQueueSend(pPrintQueue, string, 0);
				  break;
			   }
			   case COMM_CMD_UNKNOWN:
			   {
				  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Unknown command received by nRF52 module.\n",(unsigned int) HAL_GetTick());
				  xQueueSend(pPrintQueue, string, 0);
				  break;
			   }
			   case COMM_CMD_SENSOR_CONNECT_STATUS:
			   {
				  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Sensor connect status command confirmed by nRF52 module.\n",(unsigned int) HAL_GetTick());
				  xQueueSend(pPrintQueue, string, 0);
				  break;
			   }
			   default:
			   {
				  sprintf(string, "[app_init] [initThread] None defined value in nRF52 OK command feedback.\n");
				  xQueueSend(pPrintQueue, string, 0);
			   }
            }
#endif
          }
		  break;
          case COMM_CMD_UNKNOWN:
		  {
#if PRINTF_nRF52_COMMANAGER
			sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Unknown command received.\n",(unsigned int) HAL_GetTick());
			xQueueSend(pPrintQueue, string, 0);
#endif
		  }
		  break;
		  case COMM_CMD_SENSOR_CONNECT_STATUS:
          {
		     //                             0  1  2  3  4  5  6  7  8  9 10  1  2
			 //                          0x73 0D 02 0D 01 02 0D 11 29 0F 2C D4 B0
			 //                          0x73 0D 02 0D 01 02 C6 D8 42 14 35 E8 E7
			 // Example received buffer: 0x73 0D 02 0D 01 02 C6 D8 42 14 35 E8 E7
			 //                             |  |  |  |  |  |           |        |
			 //                             |  |  |  |  |  |           |        +--> CS
			 //                             |  |  |  |  |  |           +--> MAC ADDRESS
			 //                             |  |  |  |  |  +--> Connection status? 1 = not connected; 2 = connected?
			 //                             |  |  |  |  +--> Sensor nr?
			 //                             |  |  |  +--> COMM_CMD_SENSOR_CONNECT_STATUS
			 //                             |  |  +--> command type: CONFIG
			 //                             |  +--> total length of packet
			 //                             +--> start delimiter

			 // determine which module is connected
			 //
			 uint8_t lookupMacAddress [6];
			 uint8_t timesFF;
			 uint8_t timesZZ;
			 uint8_t validMacAddress = 1;
			 uint8_t timesFound = 0;
			 // step 1: take the MAC address of the module in the received stream and check if this is different than 00.00.00.00.00.00 and FF.FF.FF.FF.FF.FF
			 timesFF = 0;
			 timesZZ = 0;
			 for (int j = 0; j < 6; j++)
			 {
			    lookupMacAddress[j] = nRF52RxMsg.DU[6+j];
			    if (lookupMacAddress[j] == 0xFF)
				{
				   timesFF++;
				}
				if (lookupMacAddress[j] == 0x00)
				{
				   timesZZ++;
				}
			 }
			 if (timesFF == 0x06)
			 {
				validMacAddress = 0;
			 }
			 if (timesZZ == 0x06)
			 {
			    validMacAddress = 0;
			 }
			 // step 2: check if this lookupMacAddress is existing in the imu_array:
			 if (validMacAddress)
			 {
//        	    sprintf(string, "timesFF = %d, timesZZ = %d, valid lookup MAC Address:", timesFF, timesZZ);
//              for (int j = 0; j < 6; j++)
//              {
//                 if (strlen(string) < 147)
//                 {
//          	   	  sprintf(DUString, "%02X",lookupMacAddress[j]);
//          	   	  strcat(string, DUString);
//                 }
//              }
//              xQueueSend(pPrintQueue, string, 0);
			    for (int k = 0; k < numberOfModules; k++)
				{
				   timesFound = 0;
				   for (int j = 0; j < 6; j++)
				   {
					  if (imu_array[k]->mac_address[j] == lookupMacAddress[5-j])
					  {
						 timesFound++;
					  }
				   }
				   if (timesFound == 0x06)
				   {
					  imu_array[k]->connected = 1;
#if PRINTF_nRF52_COMMANAGER
					  sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] Sensor connect status received for module %02X.\n",(unsigned int) HAL_GetTick(),k+1);
					  xQueueSend(pPrintQueue, string, 0);
#endif
				   }
				}
             }
			 else
			 {
				  xQueueSend(pPrintQueue, "No valid lookup MAC Address.\n", 0);
			 }
			 // step 3: check if all modules are connected, if so, start calibration.
			 timesFound = 0;
			 for (int k = 0; k < numberOfModules; k++)
			 {
			    if (imu_array[k]->connected)
				{
				   timesFound++;
				}
			 }
			 if (timesFound == numberOfModules)
			 {
				numberOfModulesConnected = numberOfModules;
				// start calibration:
#if PRINTF_nRF52_COMMANAGER
				sprintf(string, "[app_nRF52_com] [nRF52ComManagerThread] All BLE nodes connected, start calibration process of each module.\n");
				xQueueSend(pPrintQueue, string, 0);
#endif
				osDelay(2000);
				comm_calibrate();
				//HAL_GPIO_WritePin(LED_ERROR_GPIO_Port, LED_ERROR_Pin, GPIO_PIN_RESET);
				//HAL_GPIO_WritePin(LED_BUSY_GPIO_Port, LED_BUSY_Pin, GPIO_PIN_SET);
			 }
          }
		  break;
		  default:
		  {
#if PRINTF_nRF52_COMMANAGER
			 sprintf(string, "%u [app_nRF52_com] [nRF52ComManagerThread] nRF52 module unknown command received: 0x%02X.\n",(unsigned int) HAL_GetTick(),nRF52RxMsg.command);
			 xQueueSend(pPrintQueue, string, 0);
#endif
		  }
		}
      }
	}
    else
    {
      if (nRF52Res == nRF52_INCORRECT_FRAME)
      {
#if PRINTF_nRF52_COM
        char DUString[4];
        sprintf(string, "nRF52 rec buffer: 0x");
        xQueueSend(pPrintQueue, string, 0);
        int loper = 0;
        for (int i = 0; i < nRF52RxMsg.length; i++)
        {
          sprintf(DUString, "%02X ",nRF52RxMsg.DU[i]);
          strcat(string, DUString);
          if (loper++ > 16)
          {
          	loper = 0;
            xQueueSend(pPrintQueue, string, 0);
            sprintf(string, "");
          }
        }
        sprintf(DUString, "  \n");
        strcat(string, DUString);
        xQueueSend(pPrintQueue, string, 0);
#endif
      }
    }
	osDelay(2); // every 2ms
  }
}

