interreg-nomade/dcu-firmware-v2/app/app_nRF52_com.c
void nRF52_RxHandler(char c)
{
    // Queue in ring buffer the rx'd byte
    ring_buffer_queue(&nRF52RingbufRx, c);
}

void nRF52_init()
{
    ring_buffer_init(&nRF52RingbufRx);
    nRF52_rst_msg(&nRF52RxMsg);
}

void nRF52_rst_msg(nRF52_msg_t * nRF52Msg)
{
  if (nRF52Msg != NULL)
  {
	nRF52Msg->command = 0;
	nRF52Msg->length = 0;
	nRF52Msg->CS = 0;
    memset(nRF52Msg->DU, 0, MAX_nRF52_PAYLOAD_LENGTH);
  }
}

nRF52_DECODER_RESULT nRF52_prot_decoder(nRF52_msg_t * nRF52Msg)
{
  static nRF52_PARSER_STATE nRF52State = nRF52_IDLE;
  nRF52_DECODER_RESULT nRF52Res = nRF52_NO_MSG;
  static unsigned int timeout = 0;

  switch (nRF52State)
  {
    case nRF52_IDLE: // check if start byte is found
    {
      if (nRF52_FindSdByte())
      {
//#if PRINTF_nRF52_COM
//        sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_IDLE] found nRF52 Start Delimiter.\n",(unsigned int) HAL_GetTick());
//	    xQueueSend(pPrintQueue, string, 0);
//#endif
//        nRF52_RstTimeout(&timeout);
//        nRF52_rst_msg(&tmpnRF52Msg);
	    nRF52State = nRF52_BUILDING_HEADER;
      }
      else
      {
    	nRF52Res = nRF52_NO_MSG;
        break;
      }
    }

    /* no break */

    case  nRF52_BUILDING_HEADER: // check if command and length is available
    {

//#if PRINTF_nRF52_COM
//      sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_BUILDING_HEADER] Start building header.\n",(unsigned int) HAL_GetTick());
//      xQueueSend(pPrintQueue, string, 0);
//#endif
      if (nRF52_HeaderPartPresent())
      {
//#if PRINTF_nRF52_COM
//        sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_BUILDING_HEADER] nRF52 header part present.\n",(unsigned int) HAL_GetTick());
//	    xQueueSend(pPrintQueue, string, 0);
//#endif
//        nRF52_RstTimeout(&timeout);
        if (nRF52_BuildHeader())
        {
          /* Could build a header */
//#if PRINTF_nRF52_COM
//          sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_BUILDING_HEADER] Command received is 0x%02X\n",(unsigned int) HAL_GetTick(), nRF52RxMsg.command);
//	      xQueueSend(pPrintQueue, string, 0);
//          sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_BUILDING_HEADER] Length of body is %d\n",(unsigned int) HAL_GetTick(), nRF52RxMsg.length);
//	      xQueueSend(pPrintQueue, string, 0);
//#endif
	      nRF52State = nRF52_BUILDING_BODY;
	      nRF52Res = nRF52_IN_PROGRESS;
        }
        else
        {
          /* Invalid header */

          if (nRF52_TimedOut(&timeout))
          {
#if PRINTF_nRF52_COM
            sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_BUILDING_HEADER] Time out in building header.\n",(unsigned int) HAL_GetTick());
    	    xQueueSend(pPrintQueue, string, 0);
            sprintf(string,"Less than 2 elements in the buffer, back to idle\n");
    	    xQueueSend(pPrintQueue, string, 0);
#endif
  			//ring_buffer_dequeue_arr(&nRF52RingbufRx, NULL, ring_buffer_num_items(&nRF52RingbufRx));
          }
	      nRF52State = nRF52_IDLE;
	      nRF52Res = nRF52_NO_MSG;
          break;
        }
      }
      else
      {
        if (nRF52_TimedOut(&timeout))
        {

#if PRINTF_nRF52_COM
          sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_BUILDING_HEADER] Time out in building header.\n",(unsigned int) HAL_GetTick());
    	  xQueueSend(pPrintQueue, string, 0);
          sprintf(string,"Less than 2 elements in the buffer, back to idle\n");
    	  xQueueSend(pPrintQueue, string, 0);
#endif
    	  //ring_buffer_dequeue_arr(&nRF52RingbufRx, NULL, ring_buffer_num_items(&nRF52RingbufRx));
        }
        else
        {
//#if PRINTF_nRF52_COM
//          sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_BUILDING_HEADER] Wrong header.\n",(unsigned int) HAL_GetTick());
//    	  xQueueSend(pPrintQueue, string, 0);
//#endif
        }
        nRF52State = nRF52_IDLE;
	    nRF52Res = nRF52_NO_MSG;
        break;
      }
    }

    /* no break */

    case  nRF52_BUILDING_BODY: // check if payload is available (length bytes)
    {

//#if PRINTF_nRF52_COM
//      sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_BUILDING_BODY] start building body.\n",(unsigned int) HAL_GetTick());
//      xQueueSend(pPrintQueue, string, 0);
//#endif
      if (nRF52_BodyPartPresent())
      {
//#if PRINTF_nRF52_COM
//        sprintf(string,"nRF52_BodyPartPresent, %u elements in ringbuffer, >= %d length.\n",(unsigned int) ring_buffer_num_items(&nRF52RingbufRx),(nRF52RxMsg.length));
//	    xQueueSend(pPrintQueue, string, 0);
//#endif
        if (nRF52_BuildBody())
        {
//#if PRINTF_nRF52_COM
//          sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_BUILDING_BODY] Going to check frame\n",(unsigned int) HAL_GetTick());
//	      xQueueSend(pPrintQueue, string, 0);
//#endif
	      nRF52State = nRF52_CHECKING_FRAME;
	      nRF52Res = nRF52_IN_PROGRESS;
        }
        else
        {
	      nRF52State = nRF52_IDLE;
	      nRF52Res = nRF52_NO_MSG;

          if (nRF52_TimedOut(&timeout))
          {
#if PRINTF_nRF52_COM
            sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_BUILDING_BODY] Time out in building body. smState = CPL_IDLE.\n",(unsigned int) HAL_GetTick());
	        xQueueSend(pPrintQueue, string, 0);
	        sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_BUILDING_BODY] Back to Idle\n",(unsigned int) HAL_GetTick());
		    xQueueSend(pPrintQueue, string, 0);
#endif
			//ring_buffer_dequeue_arr(&nRF52RingbufRx, NULL, ring_buffer_num_items(&nRF52RingbufRx));
          }
          break;
        }
        nRF52_RstTimeout(&timeout);
      }
      else
      {
		//ring_buffer_dequeue_arr(&nRF52RingbufRx, NULL, ring_buffer_num_items(&nRF52RingbufRx));
        nRF52State = nRF52_IDLE;
        nRF52Res = nRF52_NO_MSG;

        if (nRF52_TimedOut(&timeout))
        {
#if PRINTF_nRF52_COM
          sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_BUILDING_BODY] Time out in building body. smState = CPL_IDLE.\n",(unsigned int) HAL_GetTick());
	      xQueueSend(pPrintQueue, string, 0);
          sprintf(string,"nRF52 body part not present: expected %d elements, but only %u elements available, back to idle.\n",(nRF52RxMsg.length),(unsigned int) ring_buffer_num_items(&nRF52RingbufRx));
	      xQueueSend(pPrintQueue, string, 0);
#endif
	      //ring_buffer_dequeue_arr(&nRF52RingbufRx, NULL, ring_buffer_num_items(&nRF52RingbufRx));
        }

        break;
      }
    }

    /* no break */

