interreg-nomade/dcu-firmware-v2/app/app_nRF52_com.c
    case  nRF52_CHECKING_FRAME: // calculate checksum and compare
    {
//#if PRINTF_nRF52_COM
//      char DUString[4];
//      sprintf(string, "nRF52 rec buffer: 0x");
//      xQueueSend(pPrintQueue, string, 0);
//      int loper = 0;
//      for (int i = 0; i < nRF52RxMsg.length; i++)
//      {
//        sprintf(DUString, "%02X ",nRF52RxMsg.DU[i]);
//        strcat(string, DUString);
//        if (loper++ > 16)
//        {
//        	loper = 0;
//            xQueueSend(pPrintQueue, string, 0);
//            sprintf(string, "");
//        }
//      }
//      sprintf(DUString, "  \n");
//      strcat(string, DUString);
//      xQueueSend(pPrintQueue, string, 0);
//#endif
      if (nRF52_csCorrect())
      {
//#if PRINTF_nRF52_COM
//        sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_CHECKING_FRAME] Check Sum correct.\n",(unsigned int) HAL_GetTick());
//	    xQueueSend(pPrintQueue, string, 0);
//#endif
	    nRF52Res = nRF52_CORRECT_FRAME;
	    nRF52State = nRF52_IDLE;
        break;
      }
      else
      {
#if PRINTF_nRF52_COM
        sprintf(string,"%u [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_CHECKING_FRAME] Check Sum not correct, back to Idle.\n",(unsigned int) HAL_GetTick());
	    xQueueSend(pPrintQueue, string, 0);
#endif
//		ring_buffer_dequeue_arr(&nRF52RingbufRx, NULL, ring_buffer_num_items(&nRF52RingbufRx));
	    nRF52State = nRF52_IDLE;
	    nRF52Res = nRF52_INCORRECT_FRAME;
      }
    }
  }
  return nRF52Res;
}

static int nRF52_FindSdByte(void)
{
  char rxdByte;
  rxdByte = 0;
  while (!ring_buffer_is_empty(&nRF52RingbufRx))
  {
	ring_buffer_peek(&nRF52RingbufRx, &rxdByte, 0);
    if (rxdByte == NRF52_START_DELIMITER)
    {
//#if PRINTF_nRF52_COM
//      sprintf(string,"%u [app_nRF52_com] [nRF52_FindSdByte] Found start byte.\n",(unsigned int) HAL_GetTick());
//	  xQueueSend(pPrintQueue, string, 0);
//#endif
      // Sometimes, a second start delimiter occurs, see example:
	  //                                     0  1  2  3  4  5  6  7  8  9  A  B  C  D  E  F 10 11 12 13 14 15 16 17 18 19 1A 1B 1C 1D 1E 1F
      //                                                   +---+ +---+ +---+ +---+ +---+ +---+ +---+ +---+ +---+ +---------------------+
      // 20220219 17:48:43.507 -> 139193 [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_CHECKING_FRAME] Check Sum not correct, back to Idle.
      // 17:48:43.547 -> nRF52 rec buffer:0x73 73 20 01 00 03 CE FF 1E 00 11 04 01 00 F3 FF EC FF D9 FF 22 01 BC FD F2 0F 01 00 E9 FF FF FF DB
      //                                        +---> 2x 73!
      //                                    73 20 01 00 03 BD FF 1D 00 00 04 FC FF 00 00 FE FF EF FF 24 01 BE FD 06 10 01 00 E9 FF FF FF 7F
      //                                    73 20 01 00 03 C7 FF 26 00 FE 03 09 00 F9 FF F2 FF E5 FF 22 01 B0 FD 1A 10 01 00 E9 FF FF FF D9
      //                                    73 20 01 00 03 C3 FF 1A 00 0B 04 0B 00 FB FF F6 FF E3

      // 20220219 17:51:37.513 -> 313143 [app_nRF52_com] [nRF52_prot_decoder] [nRF52State = nRF52_CHECKING_FRAME] Check Sum not correct, back to Idle.
      //                                  0x73 73 20 01 00 03 7A FF 88 FF A5 04 AE 0E 27 FD 08 06 C1 FF 61 FF 7A FD A2 B7 03 00 E9 FF FF FF 51
      //                                        +---> 2x 73!
      //                                    73 20 01 00 03 81 FF 86 FF 6D 04 E5 0E 48 00 AA 06 B7 FF 7B FF 6C FD B6 B7 03 00 E9 FF FF FF 79
      //                                    73 20 01 00 03 71 FF 70 FF 4F 04 3B 10 38 02 A7 06 9D FF 89 FF 86 FD CA B7 03 00 E9 FF FF FF AC
      //                                    73 20 01 00 03 2F FF AC FF 41 04 EC 12 5D 07 30 05 72
      // check if the next byte in the ringbuffer is also the start delimiter. If so, remove.
      ring_buffer_peek(&nRF52RingbufRx, &rxdByte, 1);
      if (rxdByte == NRF52_START_DELIMITER)
      {
    	ring_buffer_dequeue(&nRF52RingbufRx, &rxdByte);
      }
      return 1;
    }
    else
    {
      ring_buffer_dequeue(&nRF52RingbufRx, &rxdByte);
    }
  }
  return 0;
}
static int nRF52_HeaderPartPresent(void)
{
  char rxdByte;
  rxdByte = 0;
  ring_buffer_peek(&nRF52RingbufRx, &rxdByte, 2);
  if (ring_buffer_num_items(&nRF52RingbufRx) >= 2) // packet_len byte + command byte
  {
	if (( rxdByte == 1) || (rxdByte == 2)) // 1 is DATA, 2 is CONFIG
	{
	  return 1;
	}
    else
    {
      return 0;
    }
  }
  else
  {
    return 0;
  }
}

static int nRF52_BuildHeader(void)
{
  char rxdByte[3];
  memset(rxdByte, 0, 3);
  if (ring_buffer_num_items(&nRF52RingbufRx) >= 3)
  {
    ring_buffer_peek(&nRF52RingbufRx, &rxdByte[0], 1);
    ring_buffer_peek(&nRF52RingbufRx, &rxdByte[1], 2);
    ring_buffer_peek(&nRF52RingbufRx, &rxdByte[2], 3);
    nRF52RxMsg.length = (int) rxdByte[0];
    nRF52RxMsg.commandType = rxdByte[1];
    nRF52RxMsg.command = rxdByte[2];
    if ((nRF52RxMsg.commandType == 1 && (nRF52RxMsg.length == 0x20 || nRF52RxMsg.length == 0x1E)) || (nRF52RxMsg.commandType == 2 && nRF52RxMsg.length < 0x55)) // DATA length is either 0x20 (RAW) or 0x1E (QUATERNIONS)
    {
      return 1;
    }
    else
    {
      return 0;
    }
  }
  else
  {
    /* Less than 2 elems in the buffer */
	return 0;
  }
}

static int nRF52_BodyPartPresent(void)
{
  if (ring_buffer_num_items(&nRF52RingbufRx) >= (nRF52RxMsg.length))
  {
    return 1;
  }
  else
  {
    return 0;
  }
}

static int nRF52_BuildBody(void)
{
  for (unsigned int i = 0; i < (nRF52RxMsg.length); i++)
  {
    if (!ring_buffer_peek(&nRF52RingbufRx, (char*)&nRF52RxMsg.DU[i], i))
    {
      /* No item at index... */
#if PRINTF_nRF52_COM
      sprintf(string,"%u [app_nRF52_com] [nRF52_BuildBody] ring_buffer_peek(), no item at index %02X\n",(unsigned int) HAL_GetTick(), nRF52RxMsg.DU[i]);
      xQueueSend(pPrintQueue, string, 0);
#endif
      return 0;
    }
    ring_buffer_peek(&nRF52RingbufRx, (char*)&nRF52RxMsg.CS, nRF52RxMsg.length-1);
  }
//#if PRINTF_nRF52_COM
//  sprintf(string,"%u [app_nRF52_com] [nRF52_BuildBody] Data Units of ring_buffer correctly transferred to nRF52RxMsg.DU\n",(unsigned int) HAL_GetTick());
//  xQueueSend(pPrintQueue, string, 0);
//#endif
  return 1;
}

static int nRF52_csCorrect(void)
{
  char CScalc = 0x00;
  for (unsigned int i = 0; i < (nRF52RxMsg.length-1); i++)
  {
    CScalc ^= nRF52RxMsg.DU[i];
  }
  ring_buffer_dequeue_arr(&nRF52RingbufRx, NULL, nRF52RxMsg.length);
  if (CScalc == nRF52RxMsg.CS)
  {
	return 1;
  }
  else
  {
    return 0;
  }
}

static int nRF52_TimedOut(unsigned int * var)
{
    *var = *var +1;
    if (*var >= 0x100)
    {
        *var = 0;
        return 1;
    }
    else
    {
        return 0;
    }
}

static void nRF52_RstTimeout(unsigned int * var)
{
    *var = 0;
}

