interreg-nomade/dcu-firmware-v2/app/app_nRF52_com.c
//void rsv_data_handler(uint8_t * buf, uint8_t sensor_number, uint8_t data_format){
//
//	int16_t sd_card_buffer [100];
//	int16_t data [10];
//	uint16_t data_values;
//	uint32_t timestamp;
//	uint16_t pakket_send_nr;
//
//	switch(data_format){
//		case DATA_FORMAT_1: {	data_values = 4;		} break;
//		case DATA_FORMAT_2: {	data_values = 3;		} break;
//		case DATA_FORMAT_3: {	data_values = 3;		} break;
//		case DATA_FORMAT_4: {	data_values = 6;		} break;
//		case DATA_FORMAT_5: {	data_values = 10;		} break;
//	}
//
//	//int16_t sd_card_buffer [NUMBER_OF_DATA_READS_IN_nRF52_PACKET * data_values];
//
//
//  for(uint8_t j = 0; j < NUMBER_OF_nRF52_PACKETS; j++){
//    uint16_t start_pos = PACKET_START_POS + 7;
//		// 1e byte: 			command "IMU_SENSOR_MODULE_REQ_SEND_DATA"
//		// 2e & 3e byte:		packet_send_nr
//		// 3e 4e 5e 6e byte:	timestamp
//
//		pakket_send_nr = buf[PACKET_START_POS + 1] | (buf[PACKET_START_POS + 2] << 8);
//		timestamp = buf[PACKET_START_POS + 3] | (buf[PACKET_START_POS + 4] << 8) | (buf[PACKET_START_POS + 5] << 16) | (buf[PACKET_START_POS + 6] << 24);
//
//    for(int i = 0; i < NUMBER_OF_DATA_READS_IN_nRF52_PACKET; i++){
//      //int16_t data [data_values];
//			for(uint8_t g = 0; g < data_values; g++){
//				data[g] = ((buf[start_pos + g*2 + data_values*2 * i] << 8) | buf[start_pos + g*2 + 1 + data_values*2 * i]);
//			}
//
//			for(uint8_t k = 0; k < data_values; k++){
//				sd_card_buffer [j*NUMBER_OF_DATA_READS_IN_nRF52_PACKET + i*data_values + k] = data[k];
//			}
//    }
//  }
//
//	SD_CARD_COM_save_data(pakket_send_nr, timestamp, sensor_number, sd_card_buffer, data_values, data_format);
//	//SD_CARD_COM_save_data_qga(pakket_send_nr, timestamp, sensor_number, sd_card_buffer);
//	//SD_CARD_COM_save_data_q(pakket_send_nr, timestamp, sensor_number, sd_card_buffer);
//}

static void BLEmoduleDataToSensorEvent1(int32_t data[20], imu_100Hz_data_t *sensorEvent)
{
   sensorEvent->rotVectors1.real = data[0];
   sensorEvent->rotVectors1.i    = data[1];
   sensorEvent->rotVectors1.j    = data[2];
   sensorEvent->rotVectors1.k    = data[3];
   sensorEvent->gyroscope1.x     = data[4];
   sensorEvent->gyroscope1.y     = data[5];
   sensorEvent->gyroscope1.z     = data[6];
   sensorEvent->accelerometer1.x = data[7];
   sensorEvent->accelerometer1.y = data[8];
   sensorEvent->accelerometer1.z = data[9];
   sensorEvent->magnetometer1.x  = data[10];
   sensorEvent->magnetometer1.y  = data[11];
   sensorEvent->magnetometer1.z  = data[12];
}

static void BLEmoduleDataToSensorEvent2(int32_t data[20], imu_100Hz_data_t *sensorEvent)
{
   sensorEvent->rotVectors2.real = data[0];
   sensorEvent->rotVectors2.i    = data[1];
   sensorEvent->rotVectors2.j    = data[2];
   sensorEvent->rotVectors2.k    = data[3];
   sensorEvent->gyroscope2.x     = data[4];
   sensorEvent->gyroscope2.y     = data[5];
   sensorEvent->gyroscope2.z     = data[6];
   sensorEvent->accelerometer2.x = data[7];
   sensorEvent->accelerometer2.y = data[8];
   sensorEvent->accelerometer2.z = data[9];
   sensorEvent->magnetometer2.x  = data[10];
   sensorEvent->magnetometer2.y  = data[11];
   sensorEvent->magnetometer2.z  = data[12];
}
